fishes_config/src/Documents/ПокупкаРыб/ПокупкаРыб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПокупкаРыб</name>
  <registerRecords>AccumulationRegister.ОстаткиПоРыбам</registerRecords>
  <tabularSections>
    <name>ПокупкаРыб_таблица</name>
    <attributes>
      <name>Аквариум</name>
      <type>
        <types>CatalogRef.Аквариумы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаРыб</name>
      <type>
        <types>CatalogRef.ПородыРыб</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПокупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fishes_config/src/Documents/ПокупкаРыб/Forms/ПокупкаРыб_форма/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыПокупкаРыб_таблица
&НаКлиенте
Процедура ПокупкаРыб_таблицаКоличествоПриИзменении(Элемент)
	Сторка = Элементы.ПокупкаРыб_таблица.ТекущиеДанные;
	РассчитатьСумму(Сторка);
КонецПроцедуры

&НаКлиенте
Процедура ПокупкаРыб_таблицаЦенаПокупкиПриИзменении(Элемент)
	Сторка = Элементы.ПокупкаРыб_таблица.ТекущиеДанные;
	РассчитатьСумму(Сторка);
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура РассчитатьСумму(Строка)
	Если ЗначениеЗаполнено(Строка.Количество) И ЗначениеЗаполнено(Строка.ЦенаПокупки) Тогда
		Строка.Сумма = Окр(Строка.Количество * Строка.ЦенаПокупки, 2);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
